app/controllers/users_controller.rb

  def register
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Mel"], ["password_digest", "$2a$12$3N4KN7w3Mp2jO2zNmMwJdOEQMKh6uNeR0.RpSRNJUgZj4tXNDhKoO"], ["created_at", "2020-01-13 18:22:38.636904"], ["updated_at", "2020-01-13 18:22:38.636904"]]

  def login
    @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Mel"], ["LIMIT", 1]]

def get_current_user
    return if !bearer_token
    decoded_jwt = decode_token(bearer_token)
    User.find(decoded_jwt[0]["user"]["id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]