app/controllers/wishlists_controller.rb

  def index
    @wishlists = Wishlist.all
---
SELECT "wishlists".* FROM "wishlists"

  def create
    @wishlist = Wishlist.new(wishlist_params)

    if @wishlist.save
---
INSERT INTO "wishlists" ("user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["product_id", 1], ["created_at", "2020-01-16 22:58:46.090327"], ["updated_at", "2020-01-16 22:58:46.090327"]]

    def set_wishlist
      @wishlist = Wishlist.find(params[:id])
---
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]